// index.js
const express = require("express");
const cors = require("cors");
// นำเข้า User Router จากโฟลเดอร์ routes
const userRoutes = require("./routes/users");

const app = express();
const PORT = 5000;

// ========================
// 1. เรียกใช้งาน Middleware
// ========================
app.use(express.json()); // สำคัญ! ทำให้ Express อ่านก้อนข้อมูลแบบ JSON ออก
app.use(cors()); // สำคัญ! ยอมให้ React (พอร์ต 5173) เรียกเข้ามาได้

// สร้าง Logger Middleware ประกาศไว้ "ก่อน" ที่จะลงมาถึง Route
const requestLogger = (req, res, next) => {
  console.log(
    `[${new Date().toLocaleTimeString()}] มีการเรียก ${req.method} ที่ ${req.url}`
  );
  next(); // ⚠️ สำคัญมาก! ต้องเรียก next() เพื่อบอกประตูด่านถัดไปว่า "ผ่านได้"
};

app.use(requestLogger);

// ========================
// 2. เรียกใช้งาน Routes (ที่แยกไฟล์ไว้)
// ========================

// เส้นทางทดสอบ
app.get("/", (req, res) => {
  res.send("Hello World! Backend ทำงานแล้ว 🎉");
});


// บอก Express ว่า "ถ้ามีใครเรียกขึ้นต้นด้วย /api/users ให้วิ่งไปดูไฟล์ userRoutes แทนนะ"
app.use("/api/users", userRoutes);

// ========================
// 3. สั่งให้ Server เริ่มทำงาน
// ========================
app.listen(PORT, () => {
  console.log(`🚀 Server is running on http://localhost:${PORT}`);
});